<?php 
session_start();
$titre="نبدة تاريخية";
include("includes/identifiants.php");
include("includes/debut.php");

include("./includes/menu.php");
include("includes/mcode.php");


?>
<p>
ها الدرس ليس إجباري يمكنك قرائته أو الإنتقال مباشرة إلى الدرس التالي<br/>
 هدا الدرس يحتوي على نبدة تاريخية عن ال html.<br/>
المتعلم: وما الفائدة من هدا؟<br/>
على الأقل عندما تجد حوار عن صديقك الجديد لا تجد نفسك offcide سنقدم معلومات سطحية فقط وأؤكد لكم أنه الدرس النظري الوحيد .</p>
<hr/>
<br/>
<h1> نبدة تاريخية عن html</h1>
	<br/>

	<h2>ما هي HTML</h2>
	<p><strong>HTML هي اللغة الأم لمتصفحك.</strong></p>
	<p>لكي نختصر القصة، HTML اخترعت في عام 1990م من قبل عالم يسمى تيم بيرنرز لي، الهدف من هذه اللغة هو تبسيط عملية وصول العلماء في جامعات مختلفة إلى البحوث التي ينشرونها، المشروع نجح بشكل لم يتصوره تيم بيرنرز لي، باختراعه HTML قام تيم بوضع أساس شبكة الويب كما نعرفها اليوم.</p>
	<p><img alt="بيرنرز " src="images/tuto/tim-lee.jpg"></p>
	<p>HTML هي لغة تسمح بعرض المعلومات (مثال: البحوث العلمية) على شبكة إنترنت، ما تراه عند زيارتك لأي صفحة في الشبكة هو ترجمة المتصفح لأوامر HTML، لكي ترى HTML لأي صفحة تزورها عليك أن تضغط على قائمة عرض "View" ثم المصدر "Source".</p>
	<p><img alt="استعرض المصدر" src="images/tuto/viewsource.png"></p>

	<p>لمن لم يعتد على رؤية هذه الأوامر، HTML تبدو معقدة لكن هذا الدرس سيساعدك على أن تفهمها.</p>

	<h2>ما فائدة HTML؟</h2>
	<p>إذا أردت إنشاء موقع فلا توجد طريقة أخرى غير استخدام لغة HTML، حتى لو استخدمت برنامجاً لإنشاء المواقع مثل دريمويفر، معرفتك للغة HTML ولو بشكل بسيط ستساعدك على إنشاء مواقع أفضل، الجميل أن هذه اللغة سهلة التعلم، في درسين فقط ستتعلم كيفية إنشاء موقعك الأول.</p>
	<p><strong>HTML تستخدم لإنشاء المواقع، هذا كل شيء ببساطة!</strong></p>
	<h2>حسناً، ماذا تعني H-T-M-L؟</h2>
	<p>HTML هي اختصار "HyperText Mark-up Language"، أنت لا تحتاج في هذه المرحلة لمعرفة ماذا تعني هذه المصطلحات، مع ذلك لنشرحها بتفصيل أكبر.</p>
	<ul>
		<li><strong>Hyper</strong> هي عكس "خطي" وهي تعني في هذه الحالة أن تنتقل من أي نقطة إلى أي نقطة بدون أن تسير في خط سير محدد، في الماضي - عندما كانت الفأرة شيء يلحقه القط - كانت الحواسيب تعمل بشكل خطي، تقوم بتنفيذ أمر ما ثم تذهب لما بعده، لكن HTML مختلفة، يمكنك أن تذهب إلى أي مكان في أي وقت، ليس بالضرورة مثلاً أن تزور موقع MSN.com قبل أن تزور HTML.net.</li>
		<li><strong>Text</strong> تعني النص، وهذه تشرح نفسها.</li>
		<li><strong>Mark-up</strong> هو ما تفعله بالنص، فهذه الكلمة تعني توصيف النص، فأنت تقوم بتوصيف النص تماماً كما تفعل مع معالجات الكلمات فتضيف العناوين والنقاط والنص السميك وغيرها.</li>
		<li><strong>Language</strong> تعني اللغة، فتقنية HTML هي لغة توصيف وهي أيضاً تستخدم العديد من كلمات اللغة الإنجليزية.</li>
	</ul>

	<p>في هذا الدرس ستتعلم أيضاً XHTML والتي تعني "Extensible HyperText Mark-up Language" وهي باختصار طريقة أحدث وأكثر تنظيماً لكتابة HTML.</p> 
	<p>الآن أنت تعرف ماذا تعني HTML وXHTML، لنبدأ مع ما يهمنا هنا: إنشاء المواقع.</p>
	<br/>
	<br/>


</body>
<html>