<?php 
session_start();
$titre="البرامج المستعملة";
include("includes/identifiants.php");
include("includes/debut.php");

include("./includes/menu.php");
include("includes/mcode.php");

?>
<p>
في الدرس لأول سنتحدث بشكل مختصر عن الأدوات التي تحتاجها لإنشاء موقعك.</p>
<hr/>

	<h2>ما الذي تحتاجه؟</h2>
	<p>في الغالب أنت تملك كل الأدوات التي تحتاجها.</p>
	<p>لديك "متصفح"، وهو البرنامج الذي يمكنك من تصفح المواقع والتجول فيها( internet explorer ,mozilla Firefox )، الآن أنت تنظر إلى هذه الصفحة من خلال متصفحك.</p>
	<p>ليس مهماً أي متصفح تستخدم، المتصفح الأكثر انتشاراً هو مايكروسوفت إنترنت إكسبلورر، لكن هناك متصفحات أخرى مثل أوبيرا وموزيلا فايرفوكس وكلها قابلة للاستخدام , لكنني أنصح بإستعمال mozilla Firefox .</p>
    <h3><a href="http://download.mozilla.org/?product=firefox-3.6.13&os=win&lang=en-GB"> تحميل mozilla Firefox</a></h3>	
	<p>ربما سمعت أو حتى استخدمت برامج مثل مايكروسوفت فرونت بيج أو ماكروميديا دريمويفر أو حتى مايكروسوفت وورد، هذه البرامج تستطيع - أو تدعي أنها تستطيع - إنشاء المواقع لك، انسى هذه البرامج الآن! لأنها لن تساعدك على تعلم كيفية كتابة صفحات موقعك.</p>
	<p>بدلاً من ذلك ستحتاج إلى محرر نصي بسيط، إذا كنت تستخدم نظام ويندوز يمكنك أن تستخدم المفكرة "Notepad" والذي يمكنك أن تجده في قائمة إبدأ "start" ثم قائمة البرامج "Program" ثم في قائمة الأدوات "Accessories":</p>

	<p><img alt="كيف تجد برنامج المفكرة" src="images/tuto/notepad.png"></p>

	<p>إذا لم تكن تستخدم ويندوز يمكنك أن تجد برامج مماثلة في أنظمة التشغيل الأخرى، فمثلاً لينكس يحوي برنامج بيكو "Pico" ونظام ماك يحوي برنامج TextEdit.</p>
	
	<p>برنامج المفكرة هو محرر نصي بسيط جداً وهو مناسب جداً لكتابة الصفحات ,لكنني أنصح بإستعمال المحرر النصي نوتباد++ (بالإنجليزية: Notepad++&rlm;) . و هو محرر نصي حر و رائع .</p>
	<h3><a href="http://sourceforge.net/projects/notepad-plus/files/notepad%2B%2B%20releases%20binary/npp%205.8.5%20bin/npp.5.8.5.Installer.exe/download"> تحميل Notpad++</a></h3>
	<p><img alt="كيف تجد برنامج المفكرة" src="images/tuto/notepad++.png"></p>
	<p>المتعلم: مامعنى برنامج حر؟وهل يجب علي إستعمال موزيلا و نوتباد++ لكي أواصل؟</p>
	<p>نقول عن برنامج حر عندما يخرج من السجن ,أنا أمزح.البرنامج الحر او opensource هو البرنامج الدي يتيح للمبرمج إنشائ برامج بحرية كاملة دون أرباح أو مشكلة مع اليسانس(الحرية الفكرية) وهو المناسب لنا ,هناك عدة مفاهيم للبرامج الحرة لكنن هدا مايهمنا الآن. </p>
	<p>طبعا لست مجبرا على إستعمال البرامج التي أستعملها,في النهاية الكل يحصل على نفس النتيجة ,لكنني أفضل تلكم البرامج لأنها تساعدك على ربح الوقت ,و الرؤية  المنظمة للكود سورس ,لانتكلم على الوقت الحالي (8أو 10 أسطر ) بل عندما ترى أن أن الكود أصبح فيه 500 أو 700 سطر ستواجه مشاكل كبيرة وهدا ما لا أتمناه لكم على كل حال.</p>
	<h2>كيف أستعمل نوتباد ++</h2>
	<p>أولا عليك تحديد لغة البرمج التي ستستعملها في نوتباد++ لأن نوتباد يستطيع الكتابة بأكثر من 40 لغة مختلفة</p>
	<p><img alt="كيف أستعمل نوتباد ++" src="images/tuto/comm_notpad.jpg"></p>
	<p>ثم تغيير تشفير النص الى UTF-8 إدا كنت ستستعمل العربية اما إدا أردت استعمال الفرنسية أو الإنخليزية لا تقم بتغيير التشفير</p>
	<p><img alt="كيف أستعمل نوتباد ++" src="images/tuto/comm2_notpad.jpg"></p>
	
	<h2>هل أحتاج بأن أكون على اتصال بالشبكة؟</h2>
	<p>لا تحتاج إلى اتصال بالشبكة سواء عند قراءتك لهذا الدرس أو عند إنشاء موقعك.</p>
	<p>إذا أردت أن تتجنب الاتصال بالشبكة عند قرائتك للدرس قم بطباعته أو ببساطة قم بقطع الاتصال واقرأ الدرس من الشاشة، يمكنك أن تقوم بإنشاء موقعك على حاسوبك ثم ترفعه إلى الشبكة عندما تنتهي منه.</p>
   <br/>
   <hr/>
   <p>عندي خبر سعيد لك,أنت الآن جاهز لتعلم html ومواصلة المغامرة.</p>
</body>
<html>